Revit 2027 API
InitialWattageIntensity(InitialWattageIntensity) Constructor
 Creates a copy of the given initial wattage intensity object
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public InitialWattageIntensity(
	InitialWattageIntensity other
)
Public Sub New (
	other As InitialWattageIntensity
)
public:
InitialWattageIntensity(
	InitialWattageIntensity^ other
)
new :
        other : InitialWattageIntensity -> InitialWattageIntensity
Parameters
other InitialWattageIntensity
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
InitialWattageIntensity Class
InitialWattageIntensity Overload
Autodesk.Revit.DB.Lighting Namespace